TRUNCATE TABLE raw_parking_events RESTART IDENTITY CASCADE;

-- Вставка тестовых данных
INSERT INTO raw_parking_events (госномер, номер_парковки, стоимость, способ_оплаты, дата_события) VALUES
('К491КХ977', 'P40', '40.00', 'СБП', '2026-02-24 10:32:00'),
('А011КХ96', 'P40', '80.00', 'СБП', '2026-02-24 10:35:00'),
('А888АА76', 'P41', '140.00', 'СБП', '2026-02-24 11:30:00'),
('К495КХ977', 'P42', '1140.00', 'СБП', '2026-02-25 10:30:00'),
('Х496КХ05', 'P42', '640.00', 'СБП', '2026-02-25 16:30:00'),
('Х491КХ95', 'P43', '20.00', 'СБП', '2026-02-25 17:30:00'),
('Х491КХ97', 'P44', '80.00', 'СБП', '2026-02-25 19:30:00'),
('Х421КХ32', 'P65', '100.00', 'СБП', '2026-02-25 20:36:00'),
('А432АА977', 'P60', '132.70', 'СБП', '2026-02-25 20:38:10'),
('О001ОО977', 'P60', '40.43', 'СБП', '2026-02-25 20:38:50');